package card

const (
	fldDoc  string = "Документ"
	fldDocD string = "Аналитика Дт"
	fldDocC string = "Аналитика Кт"
	fldCntD string = "Дебет"
	fldCntC string = "Кредит"

	repDocB   string = "вх.д."
	repDocE   string = "от"
	repCredit string = "<...>"

	tryCnt = 10
)

var elements = [...]string{
	"стойка",
	"планка",
	"панель",
	"пластина",
	"прокладка",
	"шпилька",
	"корпус",
	"блок питания",
	"печатная плата",
	"штекер",
	"разъем",
	"гнездо разъем",
	"транзистор",
	"резонатор",
	"кварцевый резонатор",
	"резистор",
	"микросхема",
	"танталовый конденсатор",
	"конденсатор",
	"реле",
	"феррит",
	"предохранитель",
	"светодиод",
	"диод",
	"кнопка",
	"сердечник ферритовый",
	"хомут",
	"прижим",
	"уголок",
}
